saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC1800_DFP.2.9.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

  <package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Keil</vendor>
    <url>http://www.keil.com/pack/</url>
    <name>LPC1800_DFP</name>
    <description>NXP LPC1800 Series Device Support, Drivers and Examples</description>

    <releases>
      <release version="2.9.0" date="2018-06-26">
        Updated EMAC driver:
        - Corrected VLAN filtering.
        Board Examples:
        - Added USB Device WinUSB_Echo examples.
        - Updated USB Host examples thread stack settings.
        - Updated emWin examples to emWin V5.46e.
      </release>
      <release version="2.8.0" date="2017-11-16">
        Device Support:
        - Updated system file with corrected SystemCoreClock initial value to match SystemInit function
        - Updated device header LPC18xx.h (added EEPROM support).
        - Updated documentation 
        Debug Description:
        - Updated debug sequences: use read modify write operation on updating DEMCR_Addr to avoid side effects.
        - Updated ResetCatchSet debug sequence to handle additional device ID Rev A.
        Board Examples:
        - Updated Board Support LED_*.c files.
        - Updated USB Device Audio example for Keil MCB1800 evaluation board.
        - Updated examples for MDK-Middleware Network using Cbundle="MDK-Pro Net_v6".
        CMSIS-Driver:
        - Updated CAN driver:
        -- Corrected SetBitrate function
        - Updated EMAC driver:
        -- Added support for CMSIS-RTOS2
      </release>
      <release version="2.7.0" date="2017-02-15">
        Updated PDSC:
        - Updated Cversion and Capiversion to be compliant to semantic version format
        - Updated device debug sequence: ResetCatchClear
        Updated CMSIS device files: corrected doxy comments is system file
        Updated CMSIS drivers:
        - Updated USART driver:
        -- Corrected send_active flag handling in USART_Send function.
        -- TX and RX pins can be configured as "not used"
        - Updated USB Host drivers: Corrected over-current pin configuration
        - Updated USB0 Device driver:
        -- Corrected device status information
        -- Added VBUS detection
        - Updated SSP and SPI driver:
        -- MISO and MOSI pins can be configured as "not used"
        -- Corrected PIN Configuration and Unconfiguration
        - Updated CAN:
        -- Corrected receive overrun clearing and signaling
        -- corrected interrupt routine (status interrupt could case lockup)
        -- corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function call
        -- corrected CAN1 IRQ routine
        -- corrected MessageSend function to return busy if transmission is in progress
        Updated examples:
        - Updated emWin examples to emWin V5.36f
        - Updated USB Device CDC ACM VirtualCOM example (corrected initial UART receive size)
        - Updated USB Host examples
        - Updated CAN example
      </release>
      <release version="2.6.0" date="2016-02-01">
        Updated GPDMA driver to transfer data larger than 4k.
        CMSIS driver:
        - added CAN: driver and configuration options in RTE_Device.h
        - updated all: corrected PowerControl function for conditional Power full state (driver must be initialized)
        - updated USART, I2S, SSP: interwork with new GPDMA driver
        - updated I2C: pending IRQ flag cleared after aborted transfer
        - updated USB Device: removed unnecessary __packed specifier for GCC compliance
        - updated EMAC: corrected return value of the ReadFrame function
        Board examples for Keil MCB1800:
        - added CAN Data and CAN RTR MDK projects
      </release>
      <release version="2.5.0" date="2015-06-19">
        Updated CMSIS drivers:
        - I2C, MCI, EMAC, I2S, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
        - I2S, SPI, USART, USB Device, USB Host: Corrected status bit-field race conditions
        - MCI:
        -- Interrupt processing optimized
        -- Data timeout handling corrected
        Updated example for USB device VirtualCOM
      </release>
      <release version="2.4.0" date="2015-04-24">
        Device support:
        - added LPC18Sxx series devices
        - updated device features
        Updated CMSIS Driver:
        - I2S: improved fs divider calculation
        - MCI: avoid DMA buffer alignment issues
        - USART:
        -- corrected disabling of receive DMA channel when aborting Receive or Transfer
        -- moved fract_div_lookup_table from header file to driver .c file
        Updated Example for USB Device Mass Storage
      </release>
      <release version="2.3.0" date="2015-03-20">
        Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
        Updated device support files:
         - LPC18xx.h (added  FLASHCFGA, FLASHCFGB register)
        Updated drivers:
         - RTE_Device.h (driver configuration):
         -- corrected RTE_USB1_IND0_PIN_EN into RTE_USB1_IND1_PIN_EN
         -- removed RTE_USB_USB0_DEV_EP and RTE_USB_USB1_DEV_EP
         - EMAC: corrected return value of PHY_Read and PHY_Write functions
         - MCI: enabled High speed capability and added block size handling
         - SSP: corrected pin handling, ssp->info->mode handling
         - USART: improved baudrate calculation
         - USB Device:
         -- corrected isochronous endpoint configuration
         -- corrected transfer procedure
         -- corrected CLK_M4_USB1_CFG into CLK_M4_USB0_CFG in USBD_PowerControl function
        Added:
         - I2S driver
         - USB Device Audio example
         - Audio Board interface for MCB1800 Evaluation Board
        Updated examples:
         - Compiler I/O software component is now used for I/O retargeting
      </release>
      <release version="2.2.0" date="2014-12-11">
        Updated for use with MDK-Middleware Version 6.2:
        - File_Demo and USB Host MassStorage examples due to new fdelete() API in File System 6.2
        - emWin GUIDemo example (corrected JOYSTICK orientation)
        Corrected:
        - USBD0 driver corrected PORTSC1_D_PFSC into USB_PORTSC1_D_PFSC
        - SCU driver SCU_SFSCLKx(clk_pin) and SCU_ENAIOx(n) macros
        - USART driver modem lines handling
        - SPI0/1 driver avoid stack corruption
        - GPDMA driver initialization and uninitialization is done from drivers
        - ETH driver implemented GetMacAddress function
        Updated SVD file.
      </release>
      <release version="2.1.0" date="2014-07-15">
        Corrected Touch calibration in GUIDemo example (for use with Keil.MDK-Middleware.6.1.0)
        Corrected conditions for SPI drivers and ARM Compiler toolchain dependency
        Updated USB Device drivers
        Updated Flash Programming Algorithm
      </release>
      <release version="2.0.0" date="2014-06-12">
        CMSIS Driver V2 compliant drivers (requires ARM.CMSIS.4.1.0)
        - I2C, MCI, SSP, USART, USB Host and Device, Ethernet MAC
        Examples for MCB1800 Evaluation Board (requires Keil.MDK-Middleware.6.0.0)
        - USB, Network, Graphics and Filesystem
        Board Support Interface drivers
        - ADC, Buttons, Joystick, Graphic LCD, Touchscreen, EEPROM, Thermometer
      </release>
      <release version="1.0.6">
        Renamed subFamilies to 185x for example.
      </release>
      <release version="1.0.5">
        Updated device description with features, added MCB1800 Board description
      </release>
      <release version="1.0.4">
        Updated I2C driver
        USB Device drivers re-implemented
      </release>
      <release version="1.0.3">
        Updated devices list
      </release>
      <release version="1.0.2">
        Updated drivers (namespace prefix ARM_ added)
      </release>
      <release version="1.0.1">
        Synchronized Middleware examples to Keil Middleware version 5.0.1
        Minor Changes
      </release>
      <release version="1.0.0">
        Beta version of LPC1800 Device Family Pack.
      </release>
    </releases>

    <keywords>
      <!-- keywords for indexing -->
      <keyword>NXP</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package NXP</keyword>
      <keyword>LPC1800</keyword>
      <keyword>LPC18xx</keyword>
    </keywords>

  <devices>
    <family Dfamily="LPC1800 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="180000000"/>

      <debug svd="SVD/LPC18xx.svd">
        <!-- Make ETB always visible in ROM Table (otherwise only visible after clearing ETBCFG register) -->
        <datapatch address="0xE00FF018" value="0xFFF43003" info="ROM Table Entry: ETB"/>
      </debug>

      <debugvars configfile="Debug/LPC18xx.dbgconf">
        __var VecResetWithPeriph    = 1; // Reset peripherals on Vector Reset

        // TPIU Pin Routing (TRACECLK fixed on PF_4)
        // - Bit 0: TRACEDATA[0]: 0 - PF_5, 1 - P7_4
        // - Bit 1: TRACEDATA[1]: 0 - PF_6, 1 - P7_5
        // - Bit 2: TRACEDATA[2]: 0 - PF_7, 1 - P7_6
        // - Bit 3: TRACEDATA[3]: 0 - PF_8, 1 - P7_7
        __var RoutingTPIU = 0x00000000;  // Default selection (MCB1800)
      </debugvars>

