saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LPC1800_DFP.2.9.0.pdsc
    <example name="HTTP Server" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/Network/HTTP_Server" version="1.0.1">
      <description>Compact Web Server with CGI interface</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Upload" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/Network/HTTP_Upload" version="1.0.0">
      <description>Web Server with CGI interface and SD/MMC Memory Card as storage media</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Upload.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/Network/SMTP_Client" version="1.0.1">
      <description>Example showing how to compose and send emails</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/Network/SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/Network/Telnet_Server" version="1.0.1">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards/Keil/MCB1800/Middleware/FileSystem/File_Demo" version="1.0.1">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card) and format each drive</description>
      <board name="MCB1800" vendor="Keil"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC1800 CMSIS">
      <description>System Startup for NXP LPC1800 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC18XX      /* Device Startup for NXP18XX */
      </RTE_Components_h>

      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_LPC18xx.s" attr="config" version="1.0.0" condition="ARM Compiler"/>
        <file category="source"  name="Device/Source/system_LPC18xx.c"      attr="config" version="1.0.2"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header"  name="RTE_Driver/Config/RTE_Device.h"      attr="config" version="2.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SCU" Cversion="1.1.0" condition="LPC1800 CMSIS">
      <description>SCU driver used by RTE Drivers for LPC1800 Series</description>
      <files>
        <file category="header" name="RTE_Driver/SCU_LPC18xx.h"/>
        <file category="source" name="RTE_Driver/SCU_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0.0" condition="LPC1800 CMSIS">
      <description>GPIO driver used by RTE Drivers for LPC1800 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC18xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.3.0" condition="LPC1800 CMSIS">
      <description>GPDMA driver used by RTE Drivers for LPC1800 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPDMA_LPC18xx.h"/>
        <file category="source" name="RTE_Driver/GPDMA_LPC18xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0.0" Cversion="1.5.0" condition="LPC1800 CMSIS SCU">
      <description>CAN Driver for LPC1800 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN0                /* Driver CAN0 */
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN_LPC18xx.c"/>
      </files>
    </component>

